{
  "main": {
    "name":"Vidushi Garg",
    "occupation":"Masters Student",
    "description":"I have more than 3 years of professional experience on both sides of the 'interface'; Frontend and Backend Development coupled with DevOps",
    "image":"profilepic.jpg",
    "bio":"I am enthusiastic about designing concurrent, fault tolerant applications and not-waking-up-at-2AM-again; System Design and Architecture is something that's always on my mind and I doubt if I'll be ever totally satisfied. And once I've planned, I final-ly do Java to create scalable systems, programs to further automate processes and deployments or to build new infrastructure tools. I love explaining things with rational approaches and I am always seeking to learn something new.",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "vidushigarg19@gmail.com",
    "phone": "857-869-2526",
    "school": "Northeastern University",
    "major": "Information Systems",
    "giturl":"https://github.com/Vidushi19?tab=repositories",
    "address":{
      "street":"75 Peterborough Street",
      "city":"Boston",
      "state":"MA",
      "zip": "02215"
    },
    "resumedownload":"https://drive.google.com/file/d/1vpMmxwF1_2qIKwujRLT-uU38HbulytZ5/view?usp=sharing",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/vidushi.garg.19/",
        "className":"fa fa-facebook"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/vidushi-garg/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/vid.u.she/",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/Vidushi19",
        "className":"fa fa-github"
      },
      {
        "name":"skype",
        "url":"http://skype.com",
        "className":"fa fa-skype"
      }
    ]
  },
  "resume":{
    "skillmessage":"I'm a tinkerer and playing around with new technologies has always been fun. But these have made the time fly for me. ",
    "education":[
      {
        "school":"Northeastern University",
        "degree":"Masters in Information Systems",
        "graduated":"Expected in August 2020",
        "description":"I am pursuing Masters of Information Systems with a FullStack Software Engineering Major. It has led me to achieve a much more thorough education in the underlying concepts, and science behind complex programming required for real-world applications. It was here that I discovered my passion for design-enriched scalable application development (web and mobile), and make it available to the world through Cloud Computing."
      },
      {
        "school":"Galgotias University",
        "degree":"Bachelors in Electronics and Communication Engineering",
        "graduated":"June 2015",
        "description":"I attended GU for my undergraduation for 4 years. This was hands-on as well as based on general theory. I learnt to build circuit boards and also database systems for fictional companies, coded several Space Invaders in Assembly Language, build and coded Arduino Robot (Line Follower) to navigate obstacle courses, a lot of Java and C++ to program data structure and much more. This is where I developed the interest to dive into developing software; the logistics that make circuits work smartly. Hence, chose a doorway to be be artistically magical!"
      }
    ],
    "work":[
      {
        "company":"WEX Inc.",
        "title":"Software Engineer Intern",
        "years":"May 2019 - Dec 2019",
        "description":"Here, I got an opportunity to work on Automation as well as Microservices (SOA) development. I worked with cross-functional teams like Seibel, DevOps, QA etc., to provide payment solutions to the fleet managers and understand the depth and breadth of the enterprises. I worked on multiple projects that the company was looking forward to. This involved a complete dedication to dig deep and learn about how to simplify payment services for travel, fuel and fleet managing industries. I got a deep insight of their management of large as well as small scale business designs. I now understand the tradeoffs needed for either. To keep the projects on track and stay informed, I have attended daily standups and weekly sprint meetings with clients and other teams. "
      },
      {
        "company":"Infosys Limited",
        "title":"Software Engineer",
        "years":"Aug 2015 - May 2018",
        "description":"I started my career as a Software Engineer in eCommerce where I performed manual as well automation application testing that gave me a foundational knowledge of how the created products are made bug-free and ideal to be used efficiently by the end-users. Later, I was transitioned to the product development team where I utilised this newly acquired knowledge to design scalable and light weight architectural products for the insurance solutions providing client. I worked as a pivot in the team. I say this, as I was there from the nascent stage of the product until its delivery and overcame all the technical and team - leading challenges. "
      }
    ],
    "skills":[
      {
        "name":"Git",
        "level" : "85%"
      },
      {
        "name":"Spring",
        "level" : "85%"
      },
      {
        "name":"ReactJs",
        "level":"60%"
      },
      {
        "name":"AWS",
        "level":"90%"
      },
      {
        "name":"HTML5",
        "level":"80%"
      },
      {
        "name":"REST",
        "level":"95%"
      },
      {
        "name":"SQL",
        "level":"80%"
      },
      {
        "name":"MongoDB",
        "level":"80%"
      },
      {
        "name":"Javascript",
        "level":"85%"
      },
      {
        "name":"Bootstrap",
        "level":"80%"
      },
      {
        "name":"Selenium",
        "level":"95%"
      },
      {
        "name":"CircleCI",
        "level":"95%"
      },
      {
        "name":"Docker",
        "level":"90%"
      },
      {
        "name":"Kubernetes",
        "level":"90%"
      },
      {
        "name":"Jenkins",
        "level":"90%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Amazon Machine Image",
        "category":"Hashicorp Packer, Shell(Bash) Script, YML, CircleCI, GIT",
        "image":"packer.png",
        "url":"https://github.com/Vidushi19/fa19-team-011-ami"
      },
      {
        "title":"Reader's Nest",
        "category":"Spring Boot, Java, Hibernate, JDBC, MYSQL, HTML, CSS, JavaScript",
        "image":"spring.png",
        "url":"https://github.com/Vidushi19/springboot_shopping"
      },
      {
        "title":"AWS Cloud Computing| CI/CD",
        "category":"CircleCI, AWS CodDeploy, Terraform, Cloud Formation, YML, Spring Boot, Amazon S3, SQS, SNS, DynamoDB, Amazon RDS, EC2",
        "image":"aws.png",
        "url":"https://github.com/Vidushi19/aws-cloud-webapp-recipe-SaaS"
      },
      {
        "title":"Ven-You: Event Management System",
        "category":"Axure RP, Selenium, Appium, Balsamiq",
        "image":"axure.webp",
        "url":"https://github.com/Vidushi19/axure_venyou"
      },
      {
        "title":"Grab-a-Bite",
        "category":"ReactJs, NodeJS, ExpressJs, MongoDB",
        "image":"mern.png",
        "url":"https://github.com/Vidushi19/grad-a-bite-mern"
      },
      {
        "title":"Serverless Computing: FaaS",
        "category":"AWS Lambda, CircleCI, DynamoDB, Java, SQS, SNS",
        "image":"lambda.png",
        "url":"https://github.com/Vidushi19/aws-cloud-lambda-FaaS"
      },
      {
        "title":"Health Management Systems",
        "category":"Java Swing, OOPs, Tableau, MySQL, NetBeans, Toad Modeller, MS - Excel",
        "image":"java.jpg",
        "url":"https://github.com/Vidushi19/oops_concepts"
      },
      {
        "title":"Ven-You: Event Management System",
        "category":"Moqups, Balsamiq",
        "image":"moqups.png",
        "url":"https://github.com/Vidushi19/moqups_venyou"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"I worked with Vidushi for about 6 months at WEX, when she was a co-op and finishing up her degree. Vidushi proved to be a key member of the Mobile and Web development. I found Vidushi to be very professional and eager to contribute to the overall value of our products. I would welcome any opportunity to work with her again.",
        "user":"Scott Gasperin, Global Fleet Mobile/Web Team, WEX Inc."
      },
      {
        "text":"Vidushi is an enthusiastic and read to pick up any task she is assigned. She quickly learns and grasps the new concepts and technologies really well. Be it a team project or an individuated task, she has performed well in all the assigned tasks. She always takes end to end ownership of the task and undoubtedly possesses more knowledge than her colleagues. She is an absolute delight to work with!",
        "user":"Sneha Mandowara"
      }
    ]
  }
}
